# StairstypeLeftSupportLateralOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeLeftSupportLateralOffset Property
ParameterTypeId Class See Also
---
"Left Lateral Offset":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeLeftSupportLateralOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeLeftSupportLateralOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeLeftSupportLateralOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace